rails-app/app/controllers/crops_controller.rb

  def index
    @crops = Crop.all
---
SELECT "crops".* FROM "crops"

  def show
    @crop = Crop.find(params[:id])
---
SELECT "crops".* FROM "crops" WHERE "crops"."id" = 980190962 LIMIT 1

  def edit
    @crop = Crop.find(params[:id])
---
SELECT "crops".* FROM "crops" WHERE "crops"."id" = 980190962 LIMIT 1

  def create
    @crop = Crop.new(params[:crop])
	@crop.field_id = @field_id

    respond_to do |format|
      if @crop.save
---
INSERT INTO "crops" ("field_id", "crop", "variety", "emergence_date", "end_date", "harvest_or_kill_date", "max_root_zone_depth", "max_allowable_depletion_frac", "max_allowable_depletion_inches", "notes", "created_at", "updated_at") VALUES (NULL, 'MyString', 'MyString', '2011-05-20 15:01:43.000000', NULL, '2011-05-20 15:01:43.000000', 1.5, 1.5, 1.5, NULL, '2011-06-02 16:50:37.000000', '2011-06-02 16:50:37.000000')

  def update
    @crop = Crop.find(params[:id])
---
SELECT "crops".* FROM "crops" WHERE "crops"."id" = 980190962 LIMIT 1

  def destroy
    @crop = Crop.find(params[:id])
    @crop.destroy
---
SELECT "crops".* FROM "crops" WHERE "crops"."id" = 980190962 LIMIT 1
DELETE FROM "crops" WHERE "crops"."id" = 980190962