rails-app/app/controllers/farms_controller.rb

  def index
    get_current_ids
    raise "no group!" unless @group_id
    # if @group then group_id = @group[:id] else group_id = 1 end
    # Now set the current farm
    get_and_set(Farm,Group,@group_id)
    # FIXME: Don't forget to insert year here!
    @farms = Farm.where(:group_id => @group_id).order(:name) do
      paginate :page => params[:page], :per_page => params[:rows]
    end
    logger.warn "No farms for group #{@group_id} found!" unless (@farms && @farms.size > 0)
---
SELECT "farms".* FROM "farms"

  def show
    @farm = Farm.find(params[:id])
---
SELECT "farms".* FROM "farms" WHERE "farms"."id" = 980190962 LIMIT 1

  def edit
    @farm = Farm.find(params[:id])
---
SELECT "farms".* FROM "farms" WHERE "farms"."id" = 980190962 LIMIT 1

  def create
    @farm = Farm.new(params[:farm])
    @farm.group = @group

    respond_to do |format|
      if @farm.save
---
INSERT INTO "farms" ("group_id", "name", "et_method_id", "notes", "created_at", "updated_at") VALUES (1, 'MyString', 1, NULL, '2011-06-01 03:33:27.000000', '2011-06-01 03:33:27.000000')

  def update
    @farm = Farm.find(params[:id])
---
SELECT "farms".* FROM "farms" WHERE "farms"."id" = 980190962 LIMIT 1

  def destroy
    @farm = Farm.find(params[:id])
    @farm.destroy
---
SELECT "farms".* FROM "farms" WHERE "farms"."id" = 980190962 LIMIT 1
DELETE FROM "farms" WHERE "farms"."id" = 980190962