rails-app/app/controllers/field_daily_weather_controller.rb

SELECT "field_daily_weather".* FROM "field_daily_weather" WHERE "field_daily_weather"."field_id" = 980190962 ORDER BY date
SELECT "field_daily_weather".* FROM "field_daily_weather"
SELECT COUNT(*) FROM "field_daily_weather" WHERE "field_daily_weather"."field_id" = 980190962
---
  def index
    page = -1
    page_size = -1
    wx_size = -1
    if params[:irrig_only]
      @field_daily_weather = []
      if params[:id]
        ev = IrrigationEvent.find(params[:id])
        pivot = ev.pivot
        field_ids = pivot.fields.collect do |field|
          qstr = "select '#{field.name}' as field_name,irrigation,id from field_daily_weather "
          qstr += "where date='#{ev.date}' and field_id=#{field.id}"
          @field_daily_weather += FieldDailyWeather.find_by_sql(qstr)
        end
      end
      wx_size = @field_daily_weather.size
      # puts "Irrig only present, found #{@field_daily_weather.size} records"
    else
      field_id = session[:field_id] || session[:field_id] = params[:field_id]
      # FIXME: Shouldn't the date be in here too? I mean, 3 years from now will we be returning 500 records?
      @field_daily_weather = FieldDailyWeather.where(:field_id => field_id).order(:date)
      wx_size = @field_daily_weather.size

SELECT "fields".* FROM "fields" WHERE "fields"."name" = 'field one' LIMIT 1
---
        start_date = Date.new(season_year,Field::START_DATE[0],Field::START_DATE[1])
        finish_date = Date.new(season_year,Field::END_DATE[0],Field::END_DATE[1])
        @soil_type = ''
        @soil_type = @field_daily_weather.first.field.soil_type.name

SELECT "field_daily_weather".* FROM "field_daily_weather" WHERE "field_daily_weather"."id" = 980190962 LIMIT 1
---
  def show
    @field_daily_weather = FieldDailyWeather.find(params[:id])

SELECT "field_daily_weather".* FROM "field_daily_weather" WHERE "field_daily_weather"."id" = 980190962 LIMIT 1
---
  def edit
    @field_daily_weather = FieldDailyWeather.find(params[:id])

INSERT INTO "field_daily_weather" ("field_id", "date", "ref_et", "adj_et", "rain", "irrigation", "entered_pct_moisture", "entered_pct_cover", "entered_leaf_area_index", "notes", "created_at", "updated_at") VALUES (1, '2011-05-20 16:00:45.000000', 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 'MyString', '2011-06-01 03:33:27.000000', '2011-06-01 03:33:27.000000')
---
  def create
    @field_daily_weather = FieldDailyWeather.new(params[:field_daily_weather])

    respond_to do |format|
      if @field_daily_weather.save

SELECT "field_daily_weather".* FROM "field_daily_weather" WHERE "field_daily_weather"."id" = 980190962 LIMIT 1
---
  def update
    @field_daily_weather = FieldDailyWeather.find(params[:id])

SELECT "field_daily_weather".* FROM "field_daily_weather" WHERE "field_daily_weather"."id" = 980190962 LIMIT 1
DELETE FROM "field_daily_weather" WHERE "field_daily_weather"."id" = 980190962
---
  def destroy
    @field_daily_weather = FieldDailyWeather.find(params[:id])
    @field_daily_weather.destroy