rails-app/app/controllers/fields_controller.rb

  def index
    get_current_ids
    @pivot_id = params[:parent_id]
    @fields = Field.where(:pivot_id => @pivot_id).order(:name) do
      paginate :page => params[:page], :per_page => params[:rows]
    end
    @fields ||= []
    respond_to do |format|
      format.html # index.html.erb
      format.xml  { render :xml => @fields }
      columns = COLUMN_NAMES
      format.json do
        json = @fields.to_jqgrid_json(columns,params[:page], params[:rows],@fields.size)
---
SELECT "fields".* FROM "fields"

  def show
    @field = Field.find(params[:id])
---
SELECT "fields".* FROM "fields" WHERE "fields"."id" = 980190962 LIMIT 1

  def edit
    @field = Field.find(params[:id])
---
SELECT "fields".* FROM "fields" WHERE "fields"."id" = 980190962 LIMIT 1

  def create
    @field = Field.new(params[:field])
    @field.pivot_id = @pivot_id

    respond_to do |format|
      if @field.save
---
INSERT INTO "fields" ("soil_type", "area", "field_capacity", "perm_wilting_pt", "pivot_id", "ref_et_station_id", "rain_station_id", "soil_moisture_station_id", "notes", "created_at", "updated_at") VALUES (NULL, 1.5, 1.5, 1.5, NULL, 1, 1, 1, NULL, '2011-06-01 03:33:27.000000', '2011-06-01 03:33:27.000000')

  def update
    @field = Field.find(params[:id])
---
SELECT "fields".* FROM "fields" WHERE "fields"."id" = 980190962 LIMIT 1

  def destroy
    @field = Field.find(params[:id])
    @field.destroy
---
SELECT "fields".* FROM "fields" WHERE "fields"."id" = 980190962 LIMIT 1
DELETE FROM "fields" WHERE "fields"."id" = 980190962