rails-app/app/controllers/irrigation_events_controller.rb

SELECT "irrigation_events".* FROM "irrigation_events"
---
  def index
    pivot_id = session[:pivot_id] || session[:pivot_id] = params[:pivot_id]
    @irrig_events = IrrigationEvent.where(:pivot_id => pivot_id).order(:date) do
      paginate :page => params[:page], :per_page => params[:rows]
    end
    puts "getting irrig events field #{pivot_id}, found #{@irrig_events.size} entries"

SELECT "irrigation_events".* FROM "irrigation_events" WHERE "irrigation_events"."id" = 980190962 LIMIT 1
---
  def show
    @irrigation_event = IrrigationEvent.find(params[:id])

SELECT "irrigation_events".* FROM "irrigation_events" WHERE "irrigation_events"."id" = 980190962 LIMIT 1
---
  def edit
    @irrigation_event = IrrigationEvent.find(params[:id])

INSERT INTO "irrigation_events" ("pivot_id", "inches_applied", "run_time", "total_volume", "created_at", "updated_at") VALUES (1, 1.5, 1.5, NULL, '2011-06-01 03:33:27.000000', '2011-06-01 03:33:27.000000')
---
  def create
    @irrigation_event = IrrigationEvent.new(params[:irrigation_event])

    respond_to do |format|
      if @irrigation_event.save

SELECT "irrigation_events".* FROM "irrigation_events" WHERE "irrigation_events"."id" = 980190962 LIMIT 1
---
  def update
    @irrigation_event = IrrigationEvent.find(params[:id])

SELECT "irrigation_events".* FROM "irrigation_events" WHERE "irrigation_events"."id" = 980190962 LIMIT 1
DELETE FROM "irrigation_events" WHERE "irrigation_events"."id" = 980190962
---
  def destroy
    @irrigation_event = IrrigationEvent.find(params[:id])
    @irrigation_event.destroy