rails-app/app/controllers/pivots_controller.rb

  def index
    get_current_ids
    @pivots = Pivot.find(:all, :conditions => ['farm_id = ?', @farm_id])
    session[:farm_id] = @farm_id
    @farm = Farm.find(@farm_id)
    @pivot = @pivots.first
---
SELECT "pivots".* FROM "pivots" WHERE (farm_id = 872273070)
SELECT "farms".* FROM "farms" WHERE "farms"."id" = 872273070 LIMIT 1
SELECT "pivots".* FROM "pivots"

  def show
    @pivot = Pivot.find(params[:id])
---
SELECT "pivots".* FROM "pivots" WHERE "pivots"."id" = 980190962 LIMIT 1

  def edit
    @pivot = Pivot.find(params[:id])
---
SELECT "pivots".* FROM "pivots" WHERE "pivots"."id" = 980190962 LIMIT 1

  def create
    @pivot = Pivot.new(params[:pivot])
    @pivot.farm_id = @farm_id

    respond_to do |format|
      if @pivot.save
---
INSERT INTO "pivots" ("farm_id", "name", "latitude", "longitude", "equipment", "pump_capacity", "some_energy_rate_metric", "cropping_year", "notes", "created_at", "updated_at") VALUES (1, 'MyString', 1.5, 1.5, 'MyString', 1.5, 1.5, 1, NULL, '2011-06-01 03:33:27.000000', '2011-06-01 03:33:27.000000')

  def update
    @pivot = Pivot.find(params[:id])
---
SELECT "pivots".* FROM "pivots" WHERE "pivots"."id" = 980190962 LIMIT 1

  def destroy
    @pivot = Pivot.find(params[:id])
    @pivot.destroy
---
SELECT "pivots".* FROM "pivots" WHERE "pivots"."id" = 980190962 LIMIT 1
DELETE FROM "pivots" WHERE "pivots"."id" = 980190962