rails-app/app/controllers/weather_stations_controller.rb

SELECT "weather_stations".* FROM "weather_stations"
---
  def index
    @weather_stations = WeatherStation.all

SELECT "weather_stations".* FROM "weather_stations" WHERE "weather_stations"."id" = 980190962 LIMIT 1
---
  def show
    @weather_station = WeatherStation.find(params[:id])

SELECT "weather_stations".* FROM "weather_stations" WHERE "weather_stations"."id" = 980190962 LIMIT 1
---
  def edit
    @weather_station = WeatherStation.find(params[:id])

INSERT INTO "weather_stations" ("group_id", "name", "location", "notes", "created_at", "updated_at") VALUES (1, 'MyString', 'MyString', NULL, '2011-06-01 03:33:27.000000', '2011-06-01 03:33:27.000000')
---
  def create
    @weather_station = WeatherStation.new(params[:weather_station])

    respond_to do |format|
      if @weather_station.save

SELECT "weather_stations".* FROM "weather_stations" WHERE "weather_stations"."id" = 980190962 LIMIT 1
---
  def update
    @weather_station = WeatherStation.find(params[:id])

SELECT "weather_stations".* FROM "weather_stations" WHERE "weather_stations"."id" = 980190962 LIMIT 1
DELETE FROM "weather_stations" WHERE "weather_stations"."id" = 980190962
---
  def destroy
    @weather_station = WeatherStation.find(params[:id])
    @weather_station.destroy