rails-app/app/controllers/weather_station_data_controller.rb

  def index
    if params[:weather_station_id]
      weather_station_id = params[:weather_station_id].to_i
    else
      weather_station_id = @group.weather_stations.first[:id]
    end
    unless @group.weather_stations.detect { |wxs| wxs[:id] == weather_station_id }
      weather_station_id = @group.weather_stations.first[:id]
    end
    @weather_station = WeatherStation.find(weather_station_id)
    @year = params[:year] ? params[:year].to_i : Time.now.year
    wx_start_date,wx_end_date = date_endpoints(@year)

    @weather_data = WeatherStationData.where(:weather_station_id => weather_station_id,:date => wx_start_date..wx_end_date).order(:date) do
      paginate :page => params[:page], :per_page => ROWS_PER_PAGE
    end
    puts "getting wx stn data for #{weather_station_id} #{@year}, found #{@weather_data.size} entries"
---
SELECT "weather_station_data".* FROM "weather_station_data"

  def show
    @weather_station_data = WeatherStationData.find(params[:id])
---
SELECT "weather_station_data".* FROM "weather_station_data" WHERE "weather_station_data"."id" = 980190962 LIMIT 1

  def edit
    @weather_station_data = WeatherStationData.find(params[:id])
---
SELECT "weather_station_data".* FROM "weather_station_data" WHERE "weather_station_data"."id" = 980190962 LIMIT 1

  def create
    @weather_station_data = WeatherStationData.new(params[:weather_station_data])

    respond_to do |format|
      if @weather_station_data.save
---
INSERT INTO "weather_station_data" ("station_id", "date", "ref_et", "rainfall", "soil_moisture", "notes", "created_at", "updated_at") VALUES (1, '2011-05-20 15:01:52.000000', 1.5, 1.5, 1.5, 'MyString', '2011-06-01 03:37:24.000000', '2011-06-01 03:37:24.000000')

  def update
    @weather_station_data = WeatherStationData.find(params[:id])
---
SELECT "weather_station_data".* FROM "weather_station_data" WHERE "weather_station_data"."id" = 980190962 LIMIT 1

  def destroy
    @weather_station_data = WeatherStationData.find(params[:id])
    @weather_station_data.destroy
---
SELECT "weather_station_data".* FROM "weather_station_data" WHERE "weather_station_data"."id" = 980190962 LIMIT 1
DELETE FROM "weather_station_data" WHERE "weather_station_data"."id" = 980190962