rails-app/app/controllers/wisp_controller.rb

  def field_status
    puts "field_status"
    @farm = Farm.find(@farm_id) if @farm_id
    @pivot = Pivot.find(@pivot_id) if @pivot_id
    @field = Field.find(@field_id) if @field_id
---
SELECT "farms".* FROM "farms" WHERE "farms"."id" = 872273070 LIMIT 1
SELECT "pivots".* FROM "pivots" WHERE ("pivots".farm_id = 872273070) LIMIT 1
SELECT "fields".* FROM "fields" WHERE ("fields".pivot_id = 425211171) LIMIT 1